{
    "id": "5c4eb9f4-21b8-11ee-be56-0242ac120002",
    "name": "Cleric",
    "class_features": {
        "hit_points":{
            "hit_dice": "1d8 per cleric level",
            "hp_at_1st_level": "8 + your Constitution modifier",
            "hp_at_higher_levels": "1d8 (or 5) + your Constitution modifier per cleric level after 1st"
        },
        "proficiencies": {
            "armor": "Light armor, medium armor, shields",
            "weapons": "All simple weapons",
            "tools": "None",
            "saving_throws": "Wisdom, Charisma",
            "skills": "Choose two from History, Insight, Medicine, Persuasion, and Religion"
        },
        "equipment": [
            "A shield and a holy symbol",
            "(a) a mace or (b) a warhammer (if proficient)",
            "(a) scale mail, (b) leather armor, or (c) chain mail (if proficient)",
            "(a) a light crossbow and 20 bolts or (b) any simple weapon",
            "(a) a priest's pack or (b) an explorer's pack"
        ]
    },
    "features": [{
        "index": "spellcasting",
        "name": "Spellcasting",
        "content": "As a conduit for divine power, you can cast cleric spells. See chapter 10 for the general rules of spellcasting and chapter 11 for a selection of cleric spells."
    },{
        "index": "cantrip",
        "name": "Cantrip",
        "content": "At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table."
    }, {
        "index": "preparing-and-casting-spells",
        "name": "Preparing and Casting Spells",
        "content": "The Cleric table shows how many spell slots you have to cast your cleric spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list." 
    },
    {
        "index": "spellcasting-ability",
        "name": "Spellcasting Ability",
        "content": "Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.\n\n- Spell save DC = 8 + your proficiency bonus + your Wisdom modifier\n\n- Spell attack modifier = your proficiency bonus + your Wisdom modifier"
    }, {
        "index": "ritual-casting",
        "name": "Ritual Casting",
        "content": "You can cast any cleric spell you know as a ritual if that spell has the ritual tag."
    }, {
        "index": "spellcasting-focus",
        "name": "Spellcasting Focus",
        "content": "You can use a holy symbol as a spellcasting focus for your cleric spells."
    }, {
        "index": "divine-domain",
        "name": "Divine Domain",
        "content": "Choose one domain related to your deity from the list of available domains. Each domain is detailed in their own feature, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.\n\n **Domain Spells** \n\nEach domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.\n\nIf you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you."
    },{
        "index": "channe-divinity",
        "name": "Channel Divinity",
        "content": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n\nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.\n\n**Channel Divinity: Turn Undead**\n\nAs an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
    },{
        "index": "divine-domain-feature",
        "name": "Divine Domain feature",
        "content": "At 2nd level, you gain a feature from your Divine Domain."
    },{
        "index": "ability-score-improvement",
        "name": "Ability Score Improvement",
        "content": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
    }, {
        "index": "destroy-undead-CR-1/2",
        "name": "Destroy Undead (CR 1/2)",
        "content": "Starting at 5th level, when an undead of CR 1/2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
    },{
        "index": "channel-divinity",
        "name": "Channel Divinity",
        "content": "Beginning at 6th level, you can use your Channel Divinity twice between rests."
    },{
        "index": "divine-domain-feature 2",
        "name": "Divine Domain feature",
        "content": "At 6nd level, you gain a feature from your Divine Domain."
    },  {
        "index": "destroy-undead-CR-1",
        "name": "Destroy Undead (CR 1)",
        "content": "Starting at 8th level, when an undead of CR 1 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
    },{
        "index": "divine-domain-feature 3",
        "name": "Divine Domain feature",
        "content": "At 8nd level, you gain a feature from your Divine Domain."
    },{
        "index": "divine-intervention",
        "name": "Divine Intervention",
        "content": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.\n\nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate.\n\nIf your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\n\nAt 20th level, your call for intervention succeeds automatically, no roll required."
    },{
        "index": "destroy-undead-CR-2",
        "name": "Destroy Undead (CR 2)",
        "content": "Starting at 11th level, when an undead of CR 2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
    },{
        "index": "destroy-undead-CR-3",
        "name": "Destroy Undead (CR 3)",
        "content": "Starting at 14th level, when an undead of CR 3 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
    },{
        "index": "destroy-undead-CR-4",
        "name": "Destroy Undead (CR 4)",
        "content": "Starting at 17th level, when an undead of CR 3 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."
    },{
        "index": "divine-domain-feature 4",
        "name": "Divine Domain feature",
        "content": "At 17nd level, you gain a feature from your Divine Domain."
    },{
        "index": "channe-divinity 2",
        "name": "Channel Divinity",
        "content": "Beginning at 18th level, you can use your Channel Divinity three times between rests."
    },{
        "index": "divine-intervention-improvement",
        "name": "Divine Intervention Improvement",
        "content": "At 20th level, your call for intervention succeeds automatically, no roll required."
    }]
}